#-----------------------------------------------------------------------------------------------------------
#                               Ejercicio 1
# ----------------------------------------------------------------------------------------------------------
# Realiza un programa que calcule la suma de los números 43582134 y 1234567, 
# almacene el resultado en una variable, e imprima el resultado por pantalla.
#-----------------------------------------------------------------------------------------------------------
número1 = 43582134
número2 = 1234567
resultado = número1 + número2
print("El resultado de sumar {0} con {1} es: {2}".format(número1, número2, resultado))
#-----------------------------------------------------------------------------------------------------------
#-----------------------------------------------------------------------------------------------------------


#-----------------------------------------------------------------------------------------------------------
#                               Ejercicio 2
# ----------------------------------------------------------------------------------------------------------
# Hoy en día, la tasa de cambio entre el euro y el dolar es de 0.85 euros por cada dólar. 
# Atendiendo a esta información, construye un programa que lea una cantidad de dólares por teclado
# informe al cliente de la cantidad de euros que obtendría al cambiar.
#-----------------------------------------------------------------------------------------------------------
tasa_de_cambio = 0.85
dolares = float(input("Escribe dolares a convertir a euros: "))
euros =  dolares * tasa_de_cambio
print(euros)
#-----------------------------------------------------------------------------------------------------------
#-----------------------------------------------------------------------------------------------------------


#-----------------------------------------------------------------------------------------------------------
#                               Ejercicio 3
# ----------------------------------------------------------------------------------------------------------
# Se cree comúnmente que 1 año humano equivale a 7 años en un perro. 
# Construye un programa que le pregunte al usuario en qué año nació y le informe de su edad perruna. 
# Asume que el año actual es 2021.
#-----------------------------------------------------------------------------------------------------------
años_humanos = int(input("Escribe cuantos años tienes para saber tus equivalentes perrunos: "))
años_perrunos = años_humanos * 7
print(años_perrunos)
#-----------------------------------------------------------------------------------------------------------
#-----------------------------------------------------------------------------------------------------------